edge.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-22 Sat 23:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On a seam</title>
<meta name="author" content="john" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">On a seam</h1>
<p>
I find myself exiting a subway train, my father is there with me.
</p>

<p>
I walk up the stairs of the station, between layered halls of glass
reflecting a brutalist, grey masonry reminiscent of calculated
machinery. I assume the architect means to impart the experience of
being inside an engine gearbox. People flood the station concourse
like oil over meshed cogs, uniformly wiped in their dark business attire.
</p>

<p>
Coming out through the shaft, to the exit, the early evening sky is an
odd haze of purplish smog. A cool breeze pushes the passers by along
the sidewalk. Something feels familiar about this place, it's
somewhere I've been before, albeit unsettling.
</p>

<p>
My father looks to the tall buildings in the distance, but is cut off
by a man walking past. The man seems to exist in two places at once,
he loses a step but continues as if nothing happened. I remark "the
people here are all on their own journies", to which my father says,
"is this where you want to go?"
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-02-10 Mon 00:00</p>
<p class="author">Author: john</p>
<p class="date">Created: 2025-02-22 Sat 23:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
